# Q1 Read the dataset from the below link

In [5]:
import numpy as np
import pandas as pd

In [6]:
data = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')

In [21]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 6 columns):
Id        1016395 non-null int64
Name      1016395 non-null object
Year      1016395 non-null int64
Gender    1016395 non-null object
State     1016395 non-null object
Count     1016395 non-null int64
dtypes: int64(3), object(3)
memory usage: 46.5+ MB

In [7]:
data.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

# 1 Delete unnamed columns

In [8]:
data.drop('Unnamed: 0',axis=1,inplace=True)

# 2 Show the distribution of male and female

In [10]:
data.Gender.value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

# 3 Show the top 5 most preferred names

In [11]:
df_name = data.Name.value_counts()

In [13]:
df_name.head(5)

Riley     1112
Avery     1080
Jordan    1073
Peyton    1064
Hayden    1049
Name: Name, dtype: int64

# 4 What is the median name occurence in the dataset

In [14]:
data_median =  (np.where(data.Id == data.Id.median()))
print (data_median)
Median_name = data.loc[data_median]
print (Median_name)

(array([508197], dtype=int64),)
             Id   Name  Year Gender State  Count
508197  2811921  Kasey  2010      F    MO      6

# Distribution of male and female born count by states

In [15]:
pd.crosstab(index=data.Gender,columns=data.State) # pd.pivot_table

State,AK,AL,AR,AZ,CA,CO,CT,DC,DE,FL,...,SD,TN,TX,UT,VA,VT,WA,WI,WV,WY
Gender,,,,,,,,,,,,,,,,,,,,,
F,2404,9878,7171,14518,45144,11424,6575,3053,2549,25781,...,2838,13063,39760,9515,14759,1398,13329,10549,4305,1456
M,2587,8419,6475,10820,31637,9183,5733,3000,2440,20070,...,2908,10588,27791,8233,11997,1618,11049,8940,3733,1904